F_V_M_v.1.0.1/0/CH4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    l1
    {
        type            fixedValue;
        value           uniform 0.8;
    }
    l2
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    w1
    {
        type            zeroGradient;
    }
    w2
    {
        type            zeroGradient;
    }
    w3
    {
        type            zeroGradient;
    }
    w4
    {
        type            zeroGradient;
    }
    w5
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
