F_V_M_v.1.0.1/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    
    l1
    {
        type            fixedValue;
        value           uniform 293;             
    }
    l2
    {
        type            uniformFixedValue;
        uniformValue    table
                        (
                            ( 0.000 1200 )
                            ( 0.041 1200 )
                            ( 0.051 293.15 )
                        );

//        type            fixedValue;
//        value           uniform 293;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
    w1
    {
        type        zeroGradient;
    }
    w2
    {
        type        zeroGradient;
    }
    w3
    {
        type        zeroGradient;
    }
    w4
    {
        type        zeroGradient;
    }
    w5
    {
        type        zeroGradient;
    }
}


// ************************************************************************* //
