F_V_M_v.1.0.1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    l1
    {
    type                flowRateInletVelocity;
    volumetricFlowRate  0.001778;
    extrapolateProfile  yes;
    value               uniform (0 0 0);
    }
    l2
    {
    type                flowRateInletVelocity;
    volumetricFlowRate  0.01828;
    extrapolateProfile  yes;
    value               uniform (0 0 0);
    }
/*    
    l1
    {
        type            fixedValue;
        value           uniform (2 0 0);
    }
    l2
    {
        type            fixedValue;
        value           uniform (2 0 0);
    }*/
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    w1
    {
        type            noSlip;
    }
    w2
    {
        type            noSlip;
    }
    w3
    {
        type            noSlip;
    }
    w4
    {
        type            noSlip;
    }
    w5
    {
        type            noSlip;
    }
}


// ************************************************************************* //
