F_V_M_v.1.0.1/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    l1
    {
        type            zeroGradient;
    }
    l2
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }
    w1
    {
        type            zeroGradient;
    }
    w2
    {
        type            zeroGradient;
    }
    w3
    {
        type            zeroGradient;
    }
    w4
    {
        type            zeroGradient;
    }
    w5
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
