F_V_M_v.1.0.1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0    0.30    0.30  )
    (2.1  0.30    0.30  )
    (2.1  0.70    0.30  )
    (0    0.70    0.30  )
    (0    0.30    0.70  )
    (2.1  0.30    0.70 )
    (2.1  0.70    0.70  )
    (0    0.70    0.70  ) //mainblock 0~7    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (168 32 32) simpleGrading (1 1 1) 
);



boundary
(
    allBoundary
    {
        type wall;
        faces
        (
          (1 5 4 0)
          (0 4 7 3)
          (0 3 2 1)
          (3 7 6 2)
	  (4 5 6 7)
	  (2 6 5 1)
        );
    }
);
// ************************************************************************* //0
