F_V_M_v.1.0.1/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
(
    {
        // Name of new patch
        name l1;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = set : name of faceSet
        set l1_FaceSet;
    }
    {
	name l2;
	patchInfo
	{
	    type patch;
	}
	constructFrom set;
	set l2_FaceSet;
    }
    {
	name e1;
	patchInfo
	{
	    type patch;
	}
	constructFrom set;
	set e1_FaceSet;
    }
);

// ************************************************************************* //
