F_V_M_v.1.0.1/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("w1.stl" "w2.stl" "w3.stl" "w4.stl" "w5.stl" "l1.stl" "l2.stl" "outlet.stl");
/*surfaces ("w2.stl");
surfaces ("w3.stl");
surfaces ("w4.stl");
surfaces ("w5.stl");
surfaces ("l1.stl");
surfaces ("l2.stl");
surfaces ("outlet.stl");*/

// Identify a feature when angle between faces < includedAngle
includedAngle       150;

subsetFeatures
{
    // Keep nonManifold edges (edges with >2 connected faces)
    nonManifoldEdges       no;

    // Keep open edges (edges with 1 connected face)
    openEdges       yes;
}

// ************************************************************************* //
